tap "alphagov/gds"
tap "barnardb/cookies"
tap "domt4/autoupdate"
tap "heroku/brew"
tap "ngrok/ngrok"
tap "oven-sh/bun"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Independent set of GDScript tools - parser, linter, formatter, and more
brew "gdtoolkit"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Native sequence editor for Git interactive rebase
brew "git-interactive-rebase-tool"
# Render markdown on the CLI
brew "glow"
# GNU multiple precision arithmetic library
brew "gmp"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Kubernetes package manager
brew "helm"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: :changed
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Install NodeJS versions
brew "node-build"
# Node.js version manager
brew "nodenv"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Parse HTML at the command-line
brew "pup"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Reverse engineering framework
brew "radare2"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Lexical database for the English language
brew "wordnet"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CLI for common commands used by Government Digital Service staff
brew "alphagov/gds/gds-cli"
# Command-line tool for extracting cookies from the user's web browser
brew "barnardb/cookies/cookies"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# GraphQL client
cask "altair-graphql-client"
# Chromium based browser
cask "arc"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# E-books management software
cask "calibre"
# Terminal-based AI coding assistant
cask "claude-code"
# Colemak mod for more comfortable typing (DH variant)
cask "colemak-dh"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Calendar software
cask "fantastical"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# 2D and 3D game engine
cask "godot"
# Vector graphics editor
cask "inkscape"
# Game client for itch.io
cask "itch"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Professional webcam software for the Opal C1
cask "opal-composer"
# Collaboration platform for API development
cask "postman"
# .NET IDE
cask "rider"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Remote pair programming app
cask "tuple"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
go "sigs.k8s.io/controller-tools/cmd/controller-gen"
go "golang.org/x/tools/gopls"
go "sigs.k8s.io/kustomize/kustomize/v4"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "cargo-binstall"
cargo "cargo-insta"
cargo "cargo-nextest"
cargo "cargo-workspaces"
cargo "just"
cargo "rustlings"
cargo "taplo-cli"
cargo "wasm-pack"
cargo "wasm-tools"
