tap "alphagov/gds"
tap "barnardb/cookies"
tap "domt4/autoupdate"
tap "heroku/brew"
tap "ngrok/ngrok"
tap "oven-sh/bun"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU multiple precision arithmetic library
brew "gmp"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Native sequence editor for Git interactive rebase
brew "git-interactive-rebase-tool"
# Render markdown on the CLI
brew "glow"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Kubernetes package manager
brew "helm"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Install NodeJS versions
brew "node-build"
# Node.js version manager
brew "nodenv"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Parse HTML at the command-line
brew "pup"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Cross-shell prompt for astronauts
brew "starship"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Lexical database for the English language
brew "wordnet"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CLI for common commands used by Government Digital Service staff
brew "alphagov/gds/gds-cli"
# Command-line tool for extracting cookies from the user's web browser
brew "barnardb/cookies/cookies"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# GraphQL client
cask "altair-graphql-client"
# Chromium based browser
cask "arc"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# E-books management software
cask "calibre"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-sdk"
# Calendar software
cask "fantastical"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Game development engine
cask "godot"
# Game client for itch.io
cask "itch"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Professional webcam software for the Opal C1
cask "opal-composer"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# .NET IDE
cask "rider"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Remote pair programming app
cask "tuple"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
vscode "ahmadawais.shades-of-purple"
vscode "alexcvzz.vscode-sqlite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ayakosky.fluffy-theme"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "craigmaslowski.erb"
vscode "csharpier.csharpier-vscode"
vscode "cucumberopen.cucumber-official"
vscode "danishsarwar.reverse-search"
vscode "dashiellpowers.ooh-a-flower"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "dnicolson.binary-plist"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eddiedover.gdscript-formatter-linter"
vscode "endormi.2077-theme"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "fooo.ruby-spec-runner"
vscode "formulahendry.auto-close-tag"
vscode "ftsamoyed.theme-pink-cat-boo"
vscode "geequlim.godot-tools"
vscode "ginfuru.better-nunjucks"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "gurgeous.bust-a-gem"
vscode "hbenl.vscode-test-explorer"
vscode "heybourn.headwind"
vscode "huytd.nord-light"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kamikillerto.vscode-colorize"
vscode "koichisasada.vscode-rdbg"
vscode "kuba-p.theme-pink-candy"
vscode "kube.theme-kay"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "monosans.djlint"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "netcorext.uuid-generator"
vscode "nopjmp.fairyfloss"
vscode "okitavera.vscode-nunjucks-formatter"
vscode "oven.bun-vscode"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "rubocop.vscode-rubocop"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shanehofstetter.rails-i18n"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sorbet.sorbet-vscode-extension"
vscode "standard.vscode-standard"
vscode "statelyai.stately-vscode"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "testdouble.vscode-standard-ruby"
vscode "theaflowers.witch-hazel"
vscode "timonwong.shellcheck"
vscode "tinaciousdesign.theme-tinaciousdesign"
vscode "tldraw-org.tldraw-vscode"
vscode "usernamehw.errorlens"
vscode "vayan.haml"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wmaurer.change-case"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
go "sigs.k8s.io/controller-tools/cmd/controller-gen"
go "golang.org/x/tools/gopls"
go "sigs.k8s.io/kustomize/kustomize/v4"
go "honnef.co/go/tools/cmd/staticcheck"
