tap "alphagov/gds"
tap "barnardb/cookies"
tap "domt4/autoupdate"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "ngrok/ngrok"
tap "oven-sh/bun"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Native sequence editor for Git interactive rebase
brew "git-interactive-rebase-tool"
# Render markdown on the CLI
brew "glow"
# GNU multiple precision arithmetic library
brew "gmp"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Install NodeJS versions
brew "node-build"
# Manage multiple NodeJS versions
brew "nodenv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Parse HTML at the command-line
brew "pup"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# CLI for common commands used by Government Digital Service staff
brew "alphagov/gds/gds-cli"
# Command-line tool for extracting cookies from the user's web browser
brew "barnardb/cookies/cookies"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# GPU-accelerated terminal emulator
cask "alacritty"
# GraphQL client
cask "altair-graphql-client"
# Chromium based browser
cask "arc"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Menu bar icon organiser
cask "bartender"
# Test localhost and staging websites
cask "browserstacklocal"
# E-books management software
cask "calibre"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Calendar software
cask "fantastical"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Game development engine
cask "godot"
# Game client for itch.io
cask "itch"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# App to manage software development and track bugs
cask "linear-linear"
# Extensible two-pane file manager
cask "marta"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Professional webcam software for the Opal C1
cask "opal-composer"
# Monitors computer mic and webcam
cask "oversight"
# Collaboration platform for API development
cask "postman"
# .NET IDE
cask "rider"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Customizable email client
cask "thunderbird"
# To-do list
cask "todoist"
# Remote pair programming app
cask "tuple"
# Management tool for Unity
cask "unity-hub"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
mas "ColorSlurp", id: 1287239339
mas "Gifski", id: 1351639930
vscode "ahmadawais.shades-of-purple"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ayakosky.fluffy-theme"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "connorshea.vscode-ruby-test-adapter"
vscode "craigmaslowski.erb"
vscode "csharpier.csharpier-vscode"
vscode "cucumberopen.cucumber-official"
vscode "danishsarwar.reverse-search"
vscode "dashiellpowers.ooh-a-flower"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "dnicolson.binary-plist"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eddiedover.gdscript-formatter-linter"
vscode "endormi.2077-theme"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "fooo.ruby-spec-runner"
vscode "formulahendry.auto-close-tag"
vscode "ftsamoyed.theme-pink-cat-boo"
vscode "geequlim.godot-tools"
vscode "ginfuru.better-nunjucks"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "gurgeous.bust-a-gem"
vscode "hbenl.vscode-test-explorer"
vscode "heybourn.headwind"
vscode "huytd.nord-light"
vscode "kamikillerto.vscode-colorize"
vscode "koichisasada.vscode-rdbg"
vscode "kuba-p.theme-pink-candy"
vscode "kube.theme-kay"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "monosans.djlint"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "netcorext.uuid-generator"
vscode "nopjmp.fairyfloss"
vscode "okitavera.vscode-nunjucks-formatter"
vscode "oven.bun-vscode"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ronnidc.nunjucks"
vscode "rubocop.vscode-rubocop"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "shanehofstetter.rails-i18n"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sorbet.sorbet-vscode-extension"
vscode "standard.vscode-standard"
vscode "statelyai.stately-vscode"
vscode "stylelint.vscode-stylelint"
vscode "tamasfe.even-better-toml"
vscode "theaflowers.witch-hazel"
vscode "tinaciousdesign.theme-tinaciousdesign"
vscode "tldraw-org.tldraw-vscode"
vscode "usernamehw.errorlens"
vscode "vayan.haml"
vscode "wakatime.vscode-wakatime"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "zanza00.random-theme-switcher"
